# Задайте список. Напишите программу, которая определит,
# присутствует ли в заданном списке строк некое число.
# будем искать число 3 в одной из строк списка

print((lambda x: '3' in x)(input("Введите список: ")))

